In [62]:
import pandas as pd
import mysql.connector

In [63]:
df_attacks = pd.read_csv('attacks_limpieza_completa.csv', index_col=0)
df_attacks.head(2)

,year,type,country,age,species_,fecha_limpia,fatal,sex,latitud,longitud,...,fatal_N,fatal_Unknown,fatal_Y,fatal_N.1,fatal_Unknown.1,fatal_Y.1,species_.1,fecha_limpia.1,type.1,age_NORM
0,2018,Boating,usa,57.0,White shark,Jun,N,F,39.78373,-100.445882,...,1,0,0,1,0,0,4,7,1,9.116327
1,2018,Unprovoked,usa,11.0,Unespecific,Jun,N,F,39.78373,-100.445882,...,1,0,0,1,0,0,3,7,7,3.804860

In [64]:
df_attacks = pd.read_csv('attacks_limpieza_completa.csv', index_col=0)
df_attacks.head(2)

,year,type,country,age,species_,fecha_limpia,fatal,sex,latitud,longitud,...,fatal_N,fatal_Unknown,fatal_Y,fatal_N.1,fatal_Unknown.1,fatal_Y.1,species_.1,fecha_limpia.1,type.1,age_NORM
0,2018,Boating,usa,57.0,White shark,Jun,N,F,39.78373,-100.445882,...,1,0,0,1,0,0,4,7,1,9.116327
1,2018,Unprovoked,usa,11.0,Unespecific,Jun,N,F,39.78373,-100.445882,...,1,0,0,1,0,0,3,7,7,3.804860

In [65]:
df_clima = pd.read_csv('datos_clima_limpio.csv', index_col=0)
df_clima.head(2)

,rh_950mb,rh_900mb,rh_850mb,rh_800mb,rh_750mb,rh_700mb,rh_650mb,rh_600mb,rh_550mb,rh_500mb,...,temp2m,lifted_index,rh2m,msl_pressure,prec_type,prec_amount,snow_depth,wind10m.direction,wind10m.speed,country
0,4,3,2,0,2,4,5,6,7,3,...,22,2,8,1018,none,0,0,225,2,usa
1,5,3,2,0,3,4,4,7,11,2,...,22,2,6,1021,none,0,0,250,2,usa

Cread la BBDD con el nombre de tiburones.

In [66]:
def crear_bbdd(nombre_bbdd):

    mydb = mysql.connector.connect(
      host="localhost",
      user="root",
      password="AlumnaAdalab" 
    )
    print("Conexi贸n realizada con 茅xito")
    
    mycursor = mydb.cursor()

    try:
        mycursor.execute(f"CREATE DATABASE IF NOT EXISTS {nombre_bbdd};")
        print(mycursor)
    except mysql.connector.Error as err:
        print(err)
        print("Error Code:", err.errno)
        print("SQLSTATE", err.sqlstate)
        print("Message", err.msg)

- Llamamos a la funci贸n con el nombre de nuestra BBDD y observamos que se ha creado.

In [67]:
mydb = crear_bbdd("tiburones")

Conexi贸n realizada con 茅xito
CMySQLCursor: CREATE DATABASE IF NOT EXISTS tiburones;

Cread las tablas de la BBDD:
- Tabla ataques
- Tabla clima

In [68]:
def crear_insertar_tabla(nombre_bbdd, contrase帽a, query):
    # nos conectamsos con el servidor usando el conector de sql
    cnx = mysql.connector.connect(user='root', password=f"{contrase帽a}",
                                     host='127.0.0.1', database=f"{nombre_bbdd}")
    # iniciamos el cursor
    mycursor = cnx.cursor()
    
    # intentamos hacer la query
    try: 
        mycursor.execute(query)
        cnx.commit() 
    # en caso de que podamos ejecutar la query devuelvenos un error para saber en que nos estamos equivocando
    except mysql.connector.Error as err:
        print(err)
        print("Error Code:", err.errno)
        print("SQLSTATE", err.sqlstate)
        print("Message", err.msg)

In [69]:
df_attacks.head(2)

,year,type,country,age,species_,fecha_limpia,fatal,sex,latitud,longitud,...,fatal_N,fatal_Unknown,fatal_Y,fatal_N.1,fatal_Unknown.1,fatal_Y.1,species_.1,fecha_limpia.1,type.1,age_NORM
0,2018,Boating,usa,57.0,White shark,Jun,N,F,39.78373,-100.445882,...,1,0,0,1,0,0,4,7,1,9.116327
1,2018,Unprovoked,usa,11.0,Unespecific,Jun,N,F,39.78373,-100.445882,...,1,0,0,1,0,0,3,7,7,3.804860

In [70]:
tabla_ataques = '''
CREATE TABLE IF NOT EXISTS `tiburones`.`ataques`(
 indice INT NOT NULL AUTO_INCREMENT,
 year INT NOT NULL,
 type VARCHAR(255) NOT NULL,
 country VARCHAR(255) NOT NULL,
 species_ VARCHAR(255) NOT NULL,
 fecha_limpia VARCHAR(255) NOT NULL,
 fatal VARCHAR(255) NOT NULL,
 sex VARCHAR(255) NOT NULL,
 latitud FLOAT NOT NULL,
 longitud FLOAT NOT NULL,
 age_NORM FLOAT NOT NULL,
 PRIMARY KEY (`indice`))
ENGINE = InnoDB;
'''

In [15]:
df_clima.columns

Index(['rh_950mb', 'rh_900mb', 'rh_850mb', 'rh_800mb', 'rh_750mb', 'rh_700mb',
       'rh_650mb', 'rh_600mb', 'rh_550mb', 'rh_500mb', 'rh_450mb', 'rh_400mb',
       'rh_350mb', 'rh_300mb', 'rh_250mb', 'rh_200mb', 'wind_950mb',
       'wind_900mb', 'wind_850mb', 'wind_800mb', 'wind_750mb', 'wind_700mb',
       'wind_650mb', 'wind_600mb', 'wind_550mb', 'wind_500mb', 'wind_450mb',
       'wind_400mb', 'wind_350mb', 'wind_300mb', 'wind_250mb', 'wind_200mb',
       'index', 'timepoint', 'cloudcover', 'highcloud', 'midcloud', 'lowcloud',
       'rh_profile', 'wind_profile', 'temp2m', 'lifted_index', 'rh2m',
       'msl_pressure', 'prec_type', 'prec_amount', 'snow_depth',
       'wind10m.direction', 'wind10m.speed', 'country'],
      dtype='object')

In [71]:
tabla_clima = '''
CREATE TABLE IF NOT EXISTS `tiburones`.`clima`(
 indice INT NOT NULL AUTO_INCREMENT,
 timepoint INT NOT NULL,
 cloudcover INT NOT NULL,
 temp2m INT NOT NULL,
 msl_pressure INT NOT NULL,
 `wind10m.direction` INT NOT NULL,
 `wind10m.speed` INT NOT NULL,
 pais VARCHAR(255) NOT NULL,
 rh_950mb INT NOT NULL,
 wind_900mb INT NOT NULL,
 PRIMARY KEY (`indice`))
ENGINE = InnoDB;
'''

Hemos elegido solo las columnas 'rh_950m' y 'wind_900mb' como representaci贸n de las dem谩s, porque elegir todas hubiera sido demasiado. Solo queriamos ver como introducir datos en la BBDD.

- Creamos las tablas

In [72]:
crear_insertar_tabla("tiburones","AlumnaAdalab", tabla_ataques)

In [57]:
crear_insertar_tabla("tiburones","AlumnaAdalab", tabla_clima)

BONUS Insertar los datos en las tablas.
 Nota Esta parte del pair es optativa y no ser谩 considerada para la evaluaci贸n

In [ ]:
df_attacks.columns

Index(['year', 'type', 'country', 'age', 'species_', 'fecha_limpia', 'fatal',
       'sex', 'latitud', 'longitud', 'country2', 'fatal_N', 'fatal_Unknown',
       'fatal_Y', 'fatal_N.1', 'fatal_Unknown.1', 'fatal_Y.1', 'species_.1',
       'fecha_limpia.1', 'type.1', 'age_NORM'],
      dtype='object')

Hemos definido el tipo de dato de la columna 'fatal' y 'sex' de forma incorrecta por lo que al intentar introducir los datos nos ha dado error en el for.

Pero aun as铆 se han introducido los datos en la BBDD para modificarlos tenemos que borrar esa tabla y volver a crearla. Por lo que haremos una query para realizar el DROP

In [60]:
# def borrar_tabla(nombre_bbdd, nombre_tabla):

#     mydb = mysql.connector.connect(
#       host="localhost",
#       user="root",
#       password="AlumnaAdalab" 
#     )
#     print("Conexi贸n realizada con 茅xito")
    
#     mycursor = mydb.cursor()

#     try:
#         mycursor.execute(f"DROP TABLE {nombre_bbdd}.{nombre_tabla};")
#         print(mycursor)
#     except mysql.connector.Error as err:
#         print(err)
#         print("Error Code:", err.errno)
#         print("SQLSTATE", err.sqlstate)
#         print("Message", err.msg)

In [61]:
#borrar_tabla('tiburones','ataques')

Conexi贸n realizada con 茅xito
CMySQLCursor: DROP TABLE tiburones.ataques;

In [ ]:
for indice, fila in df_attacks.iterrows():
    query_ataques = f"""
            INSERT INTO ataques (year, type, country, species_, fecha_limpia, fatal, sex, latitud, longitud, age_NORM)
            VALUES ({fila["year"]}, "{fila['type']}", "{fila["country"]}","{fila["species_"]}", "{fila["fecha_limpia"]}","{fila["fatal"]}","{fila["sex"]}",{fila["latitud"]},{fila["longitud"]},{fila["age_NORM"]});
            """
    crear_insertar_tabla("tiburones", "AlumnaAdalab", query_ataques)

#Por 煤ltimo nos da un error de 'nan', seguramente  hemos definido la columna como NOT NULL pero si hay nulos.
#Igualmente los datos se han introducido en la BBDD.

In [59]:
for indice, fila in df_clima.iterrows():
    query_clima = f"""
            INSERT INTO clima (timepoint, cloudcover, temp2m, msl_pressure, `wind10m.direction`, `wind10m.speed`, pais, rh_950mb, wind_900mb)  
            VALUES ( {fila["timepoint"]}, {fila['cloudcover']}, {fila['temp2m']}, {fila['msl_pressure']}, {fila['wind10m.direction']}, {fila['wind10m.speed']}, "{fila['country']}", {fila['rh_950mb']}, {fila['wind_900mb']});
            """
    crear_insertar_tabla("tiburones","AlumnaAdalab", query_clima)